app/controllers/welcome_controller.rb

SELECT "pets".* FROM "pets" ORDER BY "pets"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
  def hello
    @pet_name = Pet.first.name
    @pet_breed = Pet.first.breed